### Import required dependencies

In [13]:
import pandas as pd
import os

## Deliverable 1: Collect the Data

To collect the data that youâ€™ll need, complete the following steps:

1. Using the Pandas `read_csv` function and the `os` module, import the data from the `new_full_student_data.csv` file, and create a DataFrame called student_df. 

2. Use the head function to confirm that Pandas properly imported the data.

In [14]:
# Create the path and import the data
student_data = os.path.join('../Resources/new_full_student_data.csv')
student_data_df = pd.read_csv(student_data)

In [15]:
# Verify that the data was properly imported
student_data_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

## Deliverable 2: Prepare the Data

To prepare and clean your data for analysis, complete the following steps:
    
1. Check for and remove all rows with `NaN`, or missing, values in the student DataFrame. 

2. Check for and remove all duplicate rows in the student DataFrame.

3. Use the `str.replace` function to remove the "th" from the grade levels in the grade column.

4. Check data types using the `dtypes` property.

5. Remove the "th" suffix from every value in the grade column using `str` and `replace`.

6. Change the grade colum to the `int` type and verify column types.

7. Use the head (and/or the tail) function to preview the DataFrame.

In [16]:
# Check for null values
student_data_df.isna().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [17]:
# Drop rows with null values and verify removal
student_data_df = student_data_df.dropna()
student_data_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [18]:
# Check for duplicated rows
student_data_df.duplicated().sum()

1836

In [19]:
# Drop duplicated rows and verify removal
student_data_df = student_data_df.drop_duplicates()
student_data_df.duplicated().sum()

0

In [20]:
# Check data types
student_data_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [21]:
# Examine the grade column to understand why it is not an int
student_data_df['grade']

0         9th
1         9th
2         9th
3         9th
5         9th
         ...
19508    10th
19509    12th
19511    11th
19512    11th
19513    12th
Name: grade, Length: 14831, dtype: object

In [92]:
# Remove the non-numeric characters and verify the contents of the column
student_data_df['grade'] = student_data_df['grade'].astype(str).str.replace('th', '')
student_data_df

/var/folders/yg/w7jzj2vd7sd7zrrtpb16zbvw0000gn/T/ipykernel_33689/1076381850.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  student_data_df['grade'] = student_data_df['grade'].astype(str).str.replace('th', '')

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9,Wagner High School,89.0,70.4,Public,846745

In [90]:
# Change the grade column to the int type and verify column types
student_data_df['grade'] = student_data_df['grade'].astype(int)
student_data_df

/var/folders/yg/w7jzj2vd7sd7zrrtpb16zbvw0000gn/T/ipykernel_33689/991817230.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  student_data_df['grade'] = student_data_df['grade'].astype(int)

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9,Wagner High School,89.0,70.4,Public,846745

In [24]:
student_data_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9,Silva High School,69.7,80.3,Public,991918
5,74579444,Cynthia Johnson,9,Montgomery High School,63.5,76.9,Charter,893368

## Deliverable 3: Summarize the Data

Describe the data using summary statistics on the data as a whole and on individual columns.

1. Generate the summary statistics for each DataFrame by using the `describe` function.

2. Display the mean math score using the `mean` function. 

2. Store the minimum reading score as `min_reading_score`.

In [25]:
# Display summary statistics for the DataFrames
student_data_df.describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [26]:
# Display the mean math score using the mean function
student_data_df.mean()

/var/folders/yg/w7jzj2vd7sd7zrrtpb16zbvw0000gn/T/ipykernel_33689/414436577.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  student_data_df.mean()

student_id       6.975296e+07
grade            1.035554e+01
reading_score    7.235787e+01
math_score       6.467573e+01
school_budget    8.937427e+05
dtype: float64

In [54]:
 # Store the minimum reading score as min_reading_score
min_reading_score = student_data_df["reading_score"].min()
min_reading_row = student_data_df.loc[student_data_df["reading_score"] == min_reading_score]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9,Sullivan High School,59.0,88.2,Public,961125

## Deliverable 4: Drill Down into the Data

Drill down to specific rows, columns, and subsets of the data.

To drill down into the data, complete the following steps:

1. Use `loc` to display the grade column.

2. Use `iloc` to display the first 3 rows and columns 3, 4, and 5.

3. Show the rows for grade nine using `loc`.

4. Store the row with the minimum overall reading score as `min_reading_row` using `loc` and the `min_reading_score` found in Deliverable 3.

5. Find the reading scores for the school and grade from the output of step three using `loc` with multiple -conditional statements.

6. Using conditional statements and `loc` or `iloc`, find the mean reading score for all students in grades 11 and 12 combined.

In [89]:
# Use loc to display the grade column
student_data_df.loc[:, "grade"]

0    9
1    9
2    9
Name: grade, dtype: object

In [51]:
# Use `iloc` to display the first 3 rows and columns 3, 4, and 5.
student_data_df.iloc[:3,[3, 4, 5]]

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [80]:
# Select the rows for grade nine and display their summary statistics using `loc` and `describe`
grade_nine_df = student_data_df.loc[student_df["grade 9"] == 9]
grade_nine_df.describe()

NameError: name 'student_df' is not defined

In [60]:
# Store the row with the minimum overall reading score as `min_reading_row`
# using `loc` and the `min_reading_score` found in Deliverable 3.
min_reading_score = student_data_df["reading_score"].min()
min_reading_row = student_data_df.loc[student_data_df["reading_score"] == min_reading_score]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [69]:
# Use loc with conditionals to select all reading scores from 10th graders at Dixon High School.
student_data_df.loc[:, ["10th_grade", "school_name" == "Dixon_High_School","reading_score"]]

In [81]:
# Find the mean reading score for all students in grades 11 and 12 combined

reading_scores = student_data_df.loc[(student_data_df["grade 11"] ==11) | (student_data_df["grade"] == 12) &(student_data_df["reading_score"])]
reading_scores


## Deliverable 5: Make Comparisons Between District and Charter Schools

Compare district vs charter schools for budget, size, and scores.

Make comparisons within your data by completing the following steps:

1. Using the `groupby` and `mean` functions, look at the average reading and math scores per school type.

1. Using the `groupby` and `count` functions, find the total number of students at each school.

2. Using the `groupby` and `mean` functions, find the average budget per grade for each school type.

In [85]:
# Using the `groupby` and `mean` functions, find the average budget per grade for each school type.
avg_by_school= student_data_df.groupby(["school_type"]).mean()
avg_by_school.loc[:, ["school_budget"]]

             school_budget
school_type
Charter           870334.0
Public            903935.0

In [88]:
# Use the `groupby`, `count`, and `sort_values` functions to find the
# total number of students at each school and sort from most students to least students.

student_count_df  = student_data_df["school_name", "reading_score"].groupby(by= "school_name").count()
studentcount_by_school.rename(columns = {"reading_score":"student_count"}).sort_values(by = "student_count", ascending=False)

KeyError: ('school_name', 'reading_score')

In [86]:
 # Use groupby and mean to find the average reading and math scores for each school type.
avg_by_school = student_data_df.groupby(["school_type", "grade"]).mean()
avg_by_school.loc[:,["reading_score", "math_score"]]

                   reading_score  math_score
school_type grade
Charter     9               94.7        73.5
Public      9               74.0        79.3

# Deliverable 6: Summarize Your Findings
In the cell below, write a few sentences to describe any discoveries you made while performing your analysis along with any additional analysis you believe would be worthwhile.

   The first step of the analysis was given by collecting and preparing the data, that helped us checking and removing 1968 rows with null values, registered in the reading score. It helped us understand the type of data we were analysing: interger,object and float data.
   The next step was to summarise the data frame and using the describe function would allow us to find the average score in reading (72.35)and in math (64.67). Also we were able to find out the smallest (817615.00) and the highest school budget allocated (991918.00).
   Drilling down into the data helped us display the average, the lowest and higher value for the students in the 9th grade.
   As a last step we were able to compare the budgets of charter school being smaller (872625.656236) than the budgets allocated for the public schools(911195.558251). The most students were enrolled in Montgomery High School (2038), and the students in the 9th grade obtained the highest math scores.
   After analysing the school data, we could project other interpretation using the given data frame, for example we could find the differences between the reading score and the budget alocated to either type of school(charter or public. we could also find out if there is any corelation between the students enrroled and the budget allocated.